switchyard-seminar-05/src/test/resources/xml/soap-order-request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:switchyard-seminar:1.0">
   <soapenv:Header/>
   <soapenv:Body>
      <urn:submitOrder>
         <order>
            <urn:address>
               <firstName>John</firstName>
               <lastName>Doe</lastName>
               <street>Purkynova</street>
               <city>Brno</city>
               <zipCode>60200</zipCode>
            </urn:address>
            <id>1</id>
            <urn:item>
               <articleId>5</articleId>
               <count>2</count>
               <unitPrice>10</unitPrice>
            </urn:item>
         </order>
      </urn:submitOrder>
   </soapenv:Body>
</soapenv:Envelope>